notes.org
#+hugo_base_dir: .
#+options: author:Aimee

** Lisp-lang                                                  :lisp:@hacking:
:PROPERTIES:
:EXPORT_FILE_NAME: lisp
:EXPORT_DATE: 2020-12-19
:EXPORT_HUGO_SECTION: hacking
:EXPORT_DESCRIPTION: Lisp programming
:EXPORT_OPTIONS: toc:2
:END:

*** Official 

Website: https://lisp-lang.org/

- [[http://sbcl.org/manual/index.html][SBCL 2.1.0 User Manual]]
- [[https://www.cliki.net/Exercices][Common Lisp Programming Exercises]]
- Style Guide: 
  - https://lisp-lang.org/style-guide/
  - http://labs.ariel-networks.com/cl-style-guide.html
- Writing Libraries: https://lisp-lang.org/learn/writing-libraries
- Test with Travis-CI: https://github.com/luismbo/cl-travis
- SLIME is the “Superior Lisp Interaction Mode for Emacs”: 
  https://common-lisp.net/project/slime/doc/html/

Emacs Lisp: [[https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html][An Introduction to Programming in Emacs Lisp]]

*** Books

- [[https://www.cliki.net/Online%20tutorial][Recommended for beginners]]
- [[https://www.cliki.net/Lisp%20books][A list of favorite Lisp books.]]
- [[https://lispcookbook.github.io/cl-cookbook/][The Common Lisp Cookbook]]
- Book list: [[https://lisp-lang.org/books/][Lisp lang books]]
- *Structure and interpretation of computer programs*
- Onlisp

*** Posts

- [[https://fare.livejournal.com/188429.html][Why I haven't jumped ship from Common Lisp to Racket (just yet)]]
- [[https://www.xach.com/lisp/][Zach Beane's Lisp Resources]]

*** Videos

- [[https://www.youtube.com/watch?v=SPgjgybGb5o][Common Lisp - How to Start a New Project]]

*** Macros in Lisp

- [[https://lisp-lang.org/learn/macros][Lisp lang Macros]]
- Macro chapters from *Practical Common Lisp*:
  - [[http://www.gigamonkeys.com/book/macros-standard-control-constructs.html][Macros: Standard Control Constructs]]
  - [[http://www.gigamonkeys.com/book/macros-defining-your-own.html][Macros: Defining Your Own]]

*** History

- [[http://www.lispworks.com/documentation/HyperSpec/Body/01_ab.htm][1.1.2 History]]

*** Lectures

- [[https://www.youtube.com/watch?v=-J_xL4IGhJA&list=PLE18841CABEA24090][MIT 6.001 Structure and Interpretation, 1986]]
- [[https://www.youtube.com/watch?v=IcZSFewqr9k&list=PLkEwH_Z2WOlppy8oUfrGwFVlOuKyo3RO_&index=1][SICP]] mirror with Chinese script

