content/hacking/lisp.md
+++
title = "Lisp-lang"
author = ["Aimee Z"]
description = "Lisp programming"
date = 2020-12-19
tags = ["lisp"]
categories = ["hacking"]
draft = false
[menu.main]
  weight = 2014
  identifier = "lisp-lang"
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [Official](#official)
- [Books](#books)
- [Posts](#posts)
- [Videos](#videos)
- [Macros in Lisp](#macros-in-lisp)
- [History](#history)
- [Lectures](#lectures)

</div>
<!--endtoc-->


## Official {#official}

Website: <https://lisp-lang.org/>

-   [SBCL 2.1.0 User Manual](http://sbcl.org/manual/index.html)
-   [Common Lisp Programming Exercises](https://www.cliki.net/Exercices)
-   Style Guide:
    -   <https://lisp-lang.org/style-guide/>
    -   <http://labs.ariel-networks.com/cl-style-guide.html>
-   Writing Libraries: <https://lisp-lang.org/learn/writing-libraries>
-   Test with Travis-CI: <https://github.com/luismbo/cl-travis>
-   SLIME is the “Superior Lisp Interaction Mode for Emacs”:
    <https://common-lisp.net/project/slime/doc/html/>

Emacs Lisp: [An Introduction to Programming in Emacs Lisp](https://www.gnu.org/software/emacs/manual/html%5Fnode/eintr/index.html)


## Books {#books}

-   [Recommended for beginners](https://www.cliki.net/Online%20tutorial)
-   [A list of favorite Lisp books.](https://www.cliki.net/Lisp%20books)
-   [The Common Lisp Cookbook](https://lispcookbook.github.io/cl-cookbook/)
-   Book list: [Lisp lang books](https://lisp-lang.org/books/)
-   **Structure and interpretation of computer programs**
-   Onlisp


## Posts {#posts}

-   [Why I haven't jumped ship from Common Lisp to Racket (just yet)](https://fare.livejournal.com/188429.html)
-   [Zach Beane's Lisp Resources](https://www.xach.com/lisp/)


## Videos {#videos}

-   [Common Lisp - How to Start a New Project](https://www.youtube.com/watch?v=SPgjgybGb5o)


## Macros in Lisp {#macros-in-lisp}

-   [Lisp lang Macros](https://lisp-lang.org/learn/macros)
-   Macro chapters from **Practical Common Lisp**:
    -   [Macros: Standard Control Constructs](http://www.gigamonkeys.com/book/macros-standard-control-constructs.html)
    -   [Macros: Defining Your Own](http://www.gigamonkeys.com/book/macros-defining-your-own.html)


## History {#history}

-   [1.1.2 History](http://www.lispworks.com/documentation/HyperSpec/Body/01%5Fab.htm)


## Lectures {#lectures}

-   [MIT 6.001 Structure and Interpretation, 1986](https://www.youtube.com/watch?v=-J%5FxL4IGhJA&list=PLE18841CABEA24090)
-   [SICP](https://www.youtube.com/watch?v=IcZSFewqr9k&list=PLkEwH%5FZ2WOlppy8oUfrGwFVlOuKyo3RO%5F&index=1) mirror with Chinese script